package com.dethreeca.space_cleaner.utils;

import com.badlogic.gdx.Gdx;

public class Content {
    public static String DESCRIBE_SMALL_GARBAGE = "Мелкий мусор представляет собой отработавшие спутники, последние ступени ракет-носителей.Мелкие объекты практически не имеют огромной опасности, но при уничтожении их сложнее убрать, а повреждения у космических кораблей и спутников оставить они могут.";
    public static String DESCRIBE_MIDDLE_GARBAGE = "Средний мусор - это космические зонды, эксплуатационный мусор. Уплотнение в низкоорбитном и атмосферном пространстве космического мусора является препятствием безопасного полета воздушных летательных объектов.";
    public static String DESCRIBE_BIG_GARBAGE = "Большой мусор - это частицы краски, защитные оболочки. Заключается в воздействии на функционирующие космические аппараты( опасность повреждения и даже выхода из строя).Имеется опасность прохождения космического мусора через слои атмосферы и попадания на земную поверхность, НО в огромном большинстве случаев при попадании в атмосферу космический мусор просто сгорает.";
    public static String DESCRIBE_NET_AND_HARPOON = "Идея в том, чтобы отправить спутник с сетью и гарпуном и захватывать большой космический мусор. План удобный и дешевый, но для мелкого мусора не годится.";
    public static String DESCRIBE_TUNGSTEN_DUST ="Перезагрузка низкой орбиты с вольфрамовой пылью. Выпускается вольфрамовое облако на высоте порядка 1000 км, создав толстый слой мелких частиц материи, которые полностью окутают планету. Для мусора тем самым будет создано сопротивление и небольшие куски мусора сходили бы со своих орбит в течении нескольких десятилетий. Решение неплохое, но длительное.";
    public static String DESCRIBE_GARBAGE_TRUCK =" Система, состоящая из коллектора, распылителя сети и пункта утилизации на околоземной орбите. Такой сборщик может работать на ядерной энергии и эффективных ракетах для движения и сбора мусора.";
    public static String DESCRIBE_LASER_AND_TELESCOPE = "Прикрепление космического телескопа. Он регистрирует излучение высокоэнергетических космических лучей, которые входят в атмосферу Земли в ночное время. С помощью лазера, прикрепленного к телескопу, производится импульс, который замедляет мусор. Такой импульс способен замедлять кусок мусора пока тот не упадет на орбиту и не сгорит в атмосфере Земли.";
}

